
filters = [
        # '品质联盟专享红包150.0-5.0',
        '新客首单红包15.0-15.0',
        '品质联盟城市大牌券45.0-6.0',
        '新客首单红包16.0-16.0',
        '招行专享专星送红包20.0-9.0',
        '品质联盟城市大牌红包59.0-6.0',
        '品牌专享红包6.0-6.0',
        '新客首单红包8.0-8.0',

        #过滤星选的红包
        '星选联盟专享券60.0-10.0',
        '星选联盟专享券65.0-10.0',
        '老用户美食红包45.0-7.0',
        '老用户福利红包45.0-7.0',
        '双11新客首单红包16.0-16.0',


        ]

replace = {
        '品质联盟专享红包': '品专',
        '果蔬商超品质联盟': '果品',
        '通用红包': '通用',
        '生鲜水果超市红包': '鲜果',
        '双11果蔬商超红包': '11果蔬',
        '双11品质联盟专享红包': '11品质',
        '秋季特惠': '秋特',
        '果蔬商超专享红包': '果专',
        '饿了么通用红包': '通用',
        '麦当劳外卖红包': '麦当劳',
        '双11夜宵专享券': '11夜宵',
        '下午茶红包': '下午',
        '品质联盟美食红包': '品美',
        '水果果切尊享券': '果尊',
        '果蔬商超红包': '果商',
        '品质联盟城市大牌券': '品大牌',
        '星选联盟专享券': '星选',
        '双11加量红包': '11加量',
        '夜宵红包': '夜宵',
        '11月狂欢红包': '11狂欢',
        '饿小宝欢聚红包': '饿欢聚',
        '饿小宝超会专享红包': '饿超专',
        '双11美食红包': '11美食',
        '双11夜宵红包': '11夜宵'
}

# 活动名称
channels = [
        'mrbc_shoutao0907',
        'nr_10hbshentou',
        'nr_1111pzlm',
        'mrbc_v2',
        'alipay_shh_201909',
        'bd_cps02',
        'bd_yizhifu',
        'bd_swuc',
        'waimaijie_31',
        'bd_zsyhzxhd10',
        'alipay_couponcenter_july2019',
        'bd_cps03',
        'fkp_gz_yx11',
        'nr_10hdkey',
        '1111-zhanqu'
]


lola = {
        '山东': [117.000923, 36.675807],
        '河北': [115.48333, 38.03333],
        '吉林': [125.35000, 43.88333],
        '黑龙江': [127.63333, 47.75000],
        '辽宁': [123.38333, 41.80000],
        '内蒙古': [111.670801, 41.818311],
        '新疆': [87.68333, 43.76667],
        '甘肃': [103.73333, 36.03333],
        '宁夏': [106.26667, 37.46667],
        '山西': [112.53333, 37.86667],
        '陕西': [108.95000, 34.26667],
        '河南': [113.65000, 34.76667],
        '安徽': [117.283042, 31.86119],
        '江苏': [119.78333, 32.05000],
        '浙江': [120.20000, 30.26667],
        '福建': [118.30000, 26.08333],
        '广东': [113.23333, 23.16667],
        '江西': [115.90000, 28.68333],
        '海南': [110.35000, 20.01667],
        '广西': [108.320004, 22.82402],
        '贵州': [106.71667, 26.56667],
        '湖南': [113.00000, 28.21667],
        '湖北': [114.298572, 30.584355],
        '四川': [104.06667, 30.66667],
        '云南': [102.73333, 25.05000],
        '西藏': [91.00000, 30.60000],
        '青海': [96.75000, 36.56667],
        '天津': [117.20000, 39.13333],
        '上海': [121.55333, 31.20000],
        '重庆': [106.45000, 29.56667],
        '北京': [116.41667, 39.91667],
        # '台湾': [121.30, 25.03],
        # '香港': [114.10000, 22.20000],
        # '澳门': [113.50000, 22.20000],

}
