
filters = [
        # '品质联盟专享红包150.0-5.0',
        '新客首单红包15.0-15.0',
        '品质联盟城市大牌券45.0-6.0',
        '新客首单红包16.0-16.0',
        '招行专享专星送红包20.0-9.0',
        '品质联盟城市大牌红包59.0-6.0',
        '品牌专享红包6.0-6.0',
        '新客首单红包8.0-8.0',

        #过滤星选的红包
        '星选联盟专享券60.0-10.0',
        '老用户美食红包45.0-7.0',
        '双11新客首单红包16.0-16.0',


        ]

replace = {
        '品质联盟专享红包': '品专',
        '果蔬商超品质联盟': '果品',
        '通用红包': '通用',
        '生鲜水果超市红包': '鲜果',
        '双11果蔬商超红包': '11果蔬',
        '双11品质联盟专享红包': '11品质',
        '秋季特惠': '秋特',
        '果蔬商超专享红包': '果专',
        '饿了么通用红包': '通用',
        '麦当劳外卖红包': '麦当劳',
        '双11夜宵专享券': '11夜宵',
        '下午茶红包': '下午',
        '品质联盟美食红包': '品美',
        '水果果切尊享券': '果尊',
        '果蔬商超红包': '果商'
}

# 活动名称
channels = [
        # 'ele_ka_wpmsj_fkp',
        # 'nr_10hnshentou',
        # 'mrbc_shoutao0907',
        # 'cka-oct',
        # 'nr_10hbshentou',
        # 'nr_1111pzlm',
        # 'mrbc_v2',
        # 'alipay_shh_201909',
        # 'bd_cps02',
        # 'bd_yizhifu',
        # 'bd_swuc',
        # 'waimaijie_31'
        'bd_zsyhzxhd10',
        'alipay_couponcenter_july2019',
        'bd_cps03'
]
